{"id":246,"date":"2019-08-10T17:56:11","date_gmt":"2019-08-10T17:56:11","guid":{"rendered":"https:\/\/phox.whmcsdes.com\/startup\/?p=140"},"modified":"2021-02-20T15:53:07","modified_gmt":"2021-02-20T15:53:07","slug":"how-does-aws-pricing-work","status":"publish","type":"post","link":"https:\/\/phox.whmcsdes.com\/go\/how-does-aws-pricing-work\/","title":{"rendered":"How Does AWS Pricing Work?"},"content":{"rendered":"\n<p>You’ve heard about scaling up, but what about scaling down? Imagine you’ve got an application with thousands of users connected at once after a big marketing push. You’ve planned your infrastructure so that it can grow with the demand. However, a spike in traffic won’t last forever. If you don’t plan properly, you can be left with a ton of unnecessary infrastructure after the rush, and if you’re not using it, those spare servers are doing nothing but costing you money.<\/p>\n\n\n\n<p>The solution to this problem is to make your architecture elastic as well as scalable – but what exactly is elasticity in cloud computing?<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>We carefully review new entries from our community one by one to make sure they meet high-quality design and functionality standards.<\/p><\/blockquote>\n\n\n\n<p>An example of this situation is if your web application gets featured on a site like&nbsp;Hacker News&nbsp;or&nbsp;Product Hunt. When this happens, you’re likely to get a sudden rush of traffic. if you cannot scale up, then your application is likely to cripple under the load. The results can be incredibly damaging to your reputation – if people can’t use your site, they can’t see what you have to offer.<\/p>\n\n\n\n<h3>Scalability versus elasticity<\/h3>\n\n\n\n<p>Elasticity covers the ability to scale up but also the ability to&nbsp;<strong>scale down<\/strong>. The idea is that you can quickly provision new infrastructure to handle a high load of traffic, like the example above. But what happens after that rush? If you leave all of these new instances running, your bill will skyrocket as you will be paying for unused resources. In the worst case scenario, these resources can even cancel out revenue from the sudden rush. An elastic system prevents this from happening. After a scaled up period, your infrastructure can scale back down, meaning you will only be paying for your usual resource usage and some extra for the high traffic period.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You’ve heard about scaling up, but what about scaling down? Imagine you’ve got an application with thousands of users connected at once after a big marketing push. You’ve planned your infrastructure so that it can grow with the demand. However, a spike in traffic won’t last forever. If you don’t plan properly, you can be [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":265,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/posts\/246"}],"collection":[{"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/comments?post=246"}],"version-history":[{"count":1,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/posts\/246\/revisions"}],"predecessor-version":[{"id":266,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/posts\/246\/revisions\/266"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/media\/265"}],"wp:attachment":[{"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/media?parent=246"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/categories?post=246"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/phox.whmcsdes.com\/go\/wp-json\/wp\/v2\/tags?post=246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}